{
  "backend/main.mo": "Implements access-controlled user profiles and a full expense CRUD system with daily total calculation using Map storage and time utilities.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for key frontend files covering pages, hooks, components, and utilities.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point linking the main script and favicon with a root mount element.",
  "frontend/src/App.tsx": "Wraps the app in ThemeProvider and renders AppLayout with the DailyExpensesPage and Toaster.",
  "frontend/src/components/auth/AuthGate.tsx": "Empty placeholder component for authentication gating logic.",
  "frontend/src/components/auth/LoginButton.tsx": "Empty placeholder for the Internet Identity login/logout button.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder for the user profile setup modal.",
  "frontend/src/components/expenses/ExpenseListItem.tsx": "Displays and allows inline editing or deleting of an expense with validation and mutation hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides header, footer, and layout structure with branding and themed styling.",
  "frontend/src/features/expenses/date.ts": "Utility functions for converting between JS dates and backend nanosecond timestamps and comparing days.",
  "frontend/src/features/expenses/queryKeys.ts": "Defines centralized React Query keys for expenses and totals including the all-years total.",
  "frontend/src/features/expenses/useAllYearsTotalToNow.ts": "React Query hook that fetches the multi-year total using the anonymous actor with readiness gating.",
  "frontend/src/features/expenses/useCreateExpense.ts": "Mutation hook creating expenses and invalidating day, MTD, YTD, and all-years totals.",
  "frontend/src/features/expenses/useDailyTotal.ts": "Fetches a day's total expenses using an anonymous actor and react-query.",
  "frontend/src/features/expenses/useDeleteExpense.ts": "Creates a mutation to delete an expense and invalidates related totals and daily data.",
  "frontend/src/features/expenses/useExpensesForDay.ts": "Loads all expenses for a specific day by filtering the actor's full expense list.",
  "frontend/src/features/expenses/useMonthlyTotalToNow.ts": "Fetches the month-to-date expense total using an anonymous actor.",
  "frontend/src/features/expenses/useUpdateExpense.ts": "Updates an expense and invalidates daily, monthly, yearly, and all‑years totals.",
  "frontend/src/features/expenses/useYearlyTotalToNow.ts": "Fetches the year-to-date expense total using an anonymous actor.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a long-lived anonymous actor instance via react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and identity persistence logic.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Renders the app with react-query and Internet Identity providers.",
  "frontend/src/pages/DailyExpensesPage.tsx": "Page for viewing and adding daily expenses with totals and date selection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, sizing, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing an expense tracker’s multi-year total feature, its state, requirements, and pending feature requests."
}