{
  "backend/main.mo": "Main backend actor implementing user profile management and expense CRUD operations with access control, including functions for creating, updating, deleting, and querying expenses with authentication checks.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for expandable details sections (monthly, yearly, multi-yearly, and independent expansion) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including pages, components, hooks, and utilities for the expense tracking application with authentication and React Query integration.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm ledger-inspired neutral tones and brown/tan accents.",
  "frontend/index.html": "HTML entry point with favicon reference, meta tags, and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component wrapping the app with ThemeProvider, rendering AppLayout with DailyExpensesPage, and including Toaster for notifications.",
  "frontend/src/components/auth/AuthGate.tsx": "Empty authentication gate component file (currently unused or pass-through).",
  "frontend/src/components/auth/LoginButton.tsx": "Empty login button component file (implementation details not provided in content).",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty profile setup modal component file (implementation details not provided in content).",
  "frontend/src/components/expenses/ExpandableDetailsSection.tsx": "Reusable component with toggle button that expands/collapses to show ExpenseDetailsTable, fetching expenses via date range or accepting provided expenses array with loading states.",
  "frontend/src/components/expenses/ExpenseDetailsTable.tsx": "Table component displaying sorted expenses (most recent first) with columns for date, category, submitter, and amount, showing empty state when no expenses exist.",
  "frontend/src/components/expenses/ExpenseListItem.tsx": "Expense list item component with inline editing for name, type, and amount fields, plus save/cancel/delete actions with validation and loading states using React Query mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with sticky header showing app logo/title, main content area, and footer with copyright and caffeine.ai attribution link.",
  "frontend/src/features/expenses/date.ts": "Utility functions for converting between JavaScript Date objects and backend Time format (nanoseconds as bigint), including start-of-day conversion and same-day comparison.",
  "frontend/src/features/expenses/queryKeys.ts": "Centralized React Query key factory for expense-related queries to ensure consistent caching and invalidation across the application.",
  "frontend/src/features/expenses/useAllExpenses.ts": "React Query hook that fetches all expenses from the backend using the anonymous actor.",
  "frontend/src/features/expenses/useAllYearsTotalToNow.ts": "React Query hook that fetches the total of all expenses across all years up to now from the backend.",
  "frontend/src/features/expenses/useCreateExpense.ts": "React Query mutation hook for creating expenses that invalidates daily, monthly, yearly, and all-years total queries on success.",
  "frontend/src/features/expenses/useDailyTotal.ts": "React Query hook that fetches the total expenses for a specific day using the provided dayTime timestamp.",
  "frontend/src/features/expenses/useDeleteExpense.ts": "React Query mutation hook for deleting expenses that invalidates daily, monthly, yearly, and all-years total queries on success.",
  "frontend/src/features/expenses/useExpensesForDay.ts": "React Query hook that fetches all expenses and filters them client-side to return only expenses matching the specified day.",
  "frontend/src/features/expenses/useExpensesInRange.ts": "React Query hook that fetches expenses within a specified date range from the backend.",
  "frontend/src/features/expenses/useMonthlyTotalToNow.ts": "React Query hook that fetches the total expenses for the current month up to now from the backend.",
  "frontend/src/features/expenses/useUpdateExpense.ts": "React Query mutation hook for updating expenses that invalidates daily, monthly, yearly, and all-years total queries on success.",
  "frontend/src/features/expenses/useYearlyTotalToNow.ts": "React Query hook that fetches the total expenses for the current year up to now from the backend.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated backend actor based on Internet Identity, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAnonymousActor.ts": "React Query hook that creates and manages an anonymous (unauthenticated) backend actor for public API access.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for managing Internet Identity authentication, including login, logout, identity state, and login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including background, foreground, card, chart, and sidebar color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DailyExpensesPage.tsx": "Main page component for daily expense tracking with date selection, expense form input, and displays daily/monthly/yearly/all-time totals with expandable detail sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, border radius variables, shadows, and animation keyframes for the UI components.",
  "project_state.json": "Project metadata tracking the expense tracker app's architecture, existing features for expandable detail sections per time period, and pending backend query method implementation."
}